// Задача 1.
// Напишите условие, которое будет проверять чётное ли число, используйте оператор if.

let num = 10;


if (-num % 2 == 0) {
    console.log(`${num} - четное число`);
} else if (num % 2 != 0) {
    console.log(`${num} - нечетное число`)
} else {
    console.log("Ошибка")
}

// Задача 3.
// 1. Объявите переменные username и password.
//    Допустимые варианты имени пользователя — это "admin" или "user", а пароль должен быть равен "123456".
// 2. Если выполняется условие:
//     (username равен "admin" или "user") и пароль равен "123456"
//     то выведите сообщение "Доступ разрешен", иначе — "Доступ запрещен".
// 3. Используйте prompt для ввода имени пользователя и пароля.

alert("Добро пожаловать!");
let isLogIn;

let nameUser0 = "admin";
let passUser0 = 123456;
let nameUser1 = "user";
let passUser1 = 123456;

let userName = prompt('Введите имя пользователя', '');
let pass = prompt('Введите пароль', '');

if (userName === nameUser0 && pass === passUser0) {
    alert("Доступ разрешен");
    isLogIn = true;
} else if (userName === nameUser1 && pass === passUser1) {
    alert("Доступ разрешен");
    isLogIn = true;
} else {
    alert("Доступ запрещён");
    console.log('error');
    isLogIn = false;
}


// Задача 2.
// 1. Объявите переменную age с числовым значением.
// 2. С помощью тернарного оператора (вложенного, если нужно) присвойте переменной discount значение скидки:
//    2.1. Если age меньше 18 – скидка 10%.
//    2.2. Если age от 18 до 65 (включительно) – скидка 20%.
//    2.3. Если age больше 65 – скидка 30%.
// 3. Выведите значение discount в консоль.
// 4. *Дополнительное задание: перепишите задачу на switch-case.

let userAge = prompt('Сколько вам лет?', '');
let discount;

if (userAge < 18) {
    alert('Отлично, скидка составит 10%');
    discount = 0.9;
} else if (18 <= userAge && userAge <= 65) {
    alert('Отлично, скидка составит 20%');
    discount = 0.8;
} else if (userAge > 65) {
    alert('Отлично, скидка составит 30%');
    discount = 0.7;
} else {
    alert('Ошибка')
    console.log('error')
    discount = 1;
}

// *Задача 4.
// Создайте программу, которая рассчитывает стоимость доставки посылки, основываясь на весе и типе доставки. Программа должна запрашивать у пользователя данные с помощью prompt и выводить результат через alert.

// 1. Ввод данных:
//    1.1. Запросите у пользователя вес посылки (в килограммах).
//    1.2. Запросите у пользователя тип доставки. Допустимые варианты:
//        "Стандарт"
//        "Экспресс"
//        "Премиум"

// 2. Проверка корректности данных:
//    2.1. Если вес меньше или равен 0, выведите сообщение об ошибке: "Некорректный вес посылки".
//    2.2. Если введён тип доставки, который не соответствует ни одному из ожидаемых вариантов, выведите сообщение: "Неверный тип доставки".

// 3. Расчёт базовой стоимости доставки:
//    3.1. Определите базовую стоимость в зависимости от веса посылки:
//        Если вес меньше 1 кг, базовая стоимость — 5$.
//        Если вес от 1 кг до 5 кг (включительно), базовая стоимость — 10$.
//        Если вес больше 5 кг, базовая стоимость — 15$.

//    Для определения базовой стоимости можно использовать конструкцию if...else или тернарный оператор.

// 4. Определение коэффициента по типу доставки:
//     Используйте конструкцию switch-case для назначения коэффициента:
//        "Стандарт": коэффициент 1
//        "Экспресс": коэффициент 1.5
//        "Премиум": коэффициент 2

// 5. Расчёт итоговой стоимости доставки:
//    Итоговая стоимость = базовая стоимость * коэффициент.

// 6. Вывод результата:
//    С помощью alert выведите итоговую стоимость доставки, например: "Итоговая стоимость доставки: 15$."


let massa = prompt('Введите вес посылки', '');
let i;

if (massa > 0 && massa < 1) {
    alert('Отлично, базовая стоимость - 5$');
    i = 5;
} else if (massa >= 1 && massa <= 5) {
    alert('Отлично, базовая стоимость - 10$');
    i = 10;
} else if (massa > 5) {
    alert('Отлично, базовая стоимость - 15$');
    i = 15;
} else {
    alert('Oшибка');
    console.log('error');
}

let type = prompt('Введите тип доставки("Стандарт": коэффициент 1; "Экспресс": коэффициент 1.5; "Премиум": коэффициент 2)', 'Стандарт');
let coef

switch (type) {
    case 'Стандарт':
    coef = 1;
    break;

    case 'Экспресс':
    coef = 1.5;
    break;

    case 'Премиум':
    coef = 2;
    break;

    default:
    coef = 1;
    console.log('error')
    break;
}

let value = i *coef * discount;

alert(`Итоговая цена: ${value}!`)

alert(`Итоговая цена: ${value}!`)
